1-11 問2 貸出記録テーブル(rental)から未返却の書籍情報を貸出日について昇順で抽出してみましょう。取得列はISBNコードと貸出日(YY/MM/DDの形式)、別名はそれぞれ「ISBNコード」「貸出日」とします。以下の空欄を埋めて、SQL命令を完成させてください。
※returned が 0 だと未返却

SELECT 
  isbn AS ISBNコード,
  ① 
FROM
  rental
WHERE 
  returned = 0
②
  rental_date ASC
;


[回答]
① DATE_FORMAT(rental_date, '%y/%m/%d') AS 貸出日
② ORDER BY


[出力結果]
mysql> SELECT isbn AS ISBNコード, DATE_FORMAT(rental_date, '%y/%m/%d') AS 貸出日 FROM rental WHERE returned = 0 ORDER BY rental_date ASC;
+---------------+-----------+
| ISBNコード    | 貸出日    |
+---------------+-----------+
| 4-8833-0000-2 | 12/02/22  |
| 4-0010-0000-0 | 12/03/20  |
| 4-0010-0000-0 | 12/06/14  |
| 4-8833-0000-2 | 12/12/10  |
| 4-8833-0000-3 | 12/12/22  |
| 4-0010-0000-9 | 12/12/27  |
| 4-7981-0959-2 | 13/01/12  |
| 4-7980-0945-8 | 13/01/14  |
| 4-0010-0000-1 | 13/03/10  |
| 4-8833-0000-1 | 13/03/16  |
+---------------+-----------+
10 rows in set (0.00 sec)