1-4 問5 アンケート集計テーブル(quest)から回答日時は「2013-01-01」以降の情報のみ抜き出しましょう。取り出す列は、name, answer1, answer2列とします。


[回答]
-- questテーブルからname, answer1, answer2列を取得
--  WHERE句で取得条件を設定
--  条件:比較演算子「>=」で2013-01-01以前の情報のみに絞る
SELECT name, answer1, answer2 FROM quest WHERE answered >= '2013-01-01';


[出力結果]
mysql> SELECT name, answer1, answer2 FROM quest WHERE answered >= '2013-01-01';
+-----------------+---------+--------------------------+
| name            | answer1 | answer2                  |
+-----------------+---------+--------------------------+
| 森本雄二        |       1 | NULL                     |
| 西島泰治        |       3 | 読みやすいです。         |
| 根岸亜由美      |       3 | 絵がかわいい。           |
+-----------------+---------+--------------------------+
3 rows in set (0.00 sec)
