3-7 問3 社員テーブル(employee)上、退職済みで、最終更新日が2007-03-31以前のデータを削除してみましょう。


[回答]
-- DELETE命令で社員テーブル(employee)を削除
DELETE FROM
  employee
-- 削除条件
-- retired列の値が '1' のレコードのみ
WHERE
  retired = 1
AND
-- 追加削除条件
-- last_update列の値が '2007-03-31' 以前のレコードのみ
  last_update <= '2007-03-31'
;


[出力結果]
DELETE 1

  s_id   | l_name | f_name | l_name_kana | f_name_kana | sex |    class     | depart_id |  b_id   | last_update | retired 
---------+--------+--------+-------------+-------------+-----+--------------+-----------+---------+-------------+---------
 NI00001 | 西     | 雄一   | ニシ        | ユウイチ    |   1 | アシスタント | Z99       |         | 2013-01-10  |       0
 NI00002 | 新渡戸 | 康治   | ニトベ      | コウジ      |   1 | アシスタント | Z99       |         | 2013-01-15  |       0
 AI00001 | 相沢   | 聡     | アイザワ    | サトシ      |   1 | リーダー     | Z99       |         | 2012-02-24  |       0
 DA00001 | 大門   | 一郎   | ダイモン    | イチロウ    |   1 | 担当         | Z99       | AI00001 | 2011-08-10  |       0
 FU00001 | 藤井   | 雄太   | フジイ      | ユウタ      |   1 | 主任         | Z99       | SE00001 | 2011-04-10  |       0
 FU00002 | 藤岡   | 幸太郎 | フジオカ    | コウタロウ  |   1 | 担当         | Z99       | FU00001 | 2011-06-12  |       0
 HA0002  | 葉山   | 俊輔   | ハヤマ      | シュンスケ  |   1 | アシスタント | Z99       | FU00002 | 2012-12-11  |       0
 KA00001 | 川口   | 裕子   | カワグチ    | ユウコ      |   2 | アシスタント | Z99       | KI0001  | 2012-12-28  |       1
 KA00002 | 加藤   | 昭雄   | カトウ      | アキオ      |   1 | アシスタント | Z99       | KI0001  | 2011-11-11  |       0
 KA00003 | 神田   | 佐知子 | カンダ      | サチコ      |   1 | アシスタント | Z99       | KA00003 | 2012-01-28  |       0
 KI00001 | 木村   | 一郎   | キムラ      | イチロウ    |   1 | 担当         | Z99       | TA00001 | 2011-07-12  |       0
 NA00001 | 中澤   | 康代   | ナカザワ    | ヤスヨ      |   2 | アシスタント | Z99       | TO00002 | 2012-04-17  |       1
 NO00001 | 野上   | 利江   | ノガミ      | リエ        |   2 | アシスタント | Z99       | TO00002 | 2012-06-30  |       0
 SA00001 | 佐藤   | 智子   | サトウ      | トモコ      |   2 | リーダー     | Z99       |         | 2010-02-01  |       0
 SE00001 | 妹尾   | 春樹   | セノオ      | ハルキ      |   1 | マネージャー | Z99       | TE00001 | 2010-12-10  |       0
 SI00001 | 清水   | 春子   | シミズ      | ハルコ      |   2 | 主任         | Z99       | SI00001 | 2011-12-11  |       0
 TA00001 | 田中   | 真由子 | タナカ      | マユコ      |   2 | 主任         | Z99       | YA00001 | 2011-05-26  |       0
 TA00002 | 田辺   | 正一   | タナベ      | ショウイチ  |   1 | アシスタント | Z99       | HA0002  | 2012-12-19  |       0
 TE00001 | 寺岡   | 陽一   | テラオカ    | ヨウイチ    |   1 | リーダー     | Z99       | HA0001  | 2009-12-11  |       0
 TI00001 | 近田   | 晃子   | チカダ      | アキコ      |   2 | マネージャー | Z99       | AI00001 | 2012-03-01  |       0
 TO00001 | 遠山   | 真一   | トオヤマ    | シンイチ    |   1 | マネージャー | Z99       | UE00001 | 2010-12-16  |       0
 TO00002 | 戸川   | よしみ | トガワ      | ヨシミ      |   2 | 担当         | Z99       | TU00001 | 2012-04-01  |       0
 TU00001 | 津村   | 知美   | ツムラ      | カズミ      |   2 | 主任         | Z99       | TI00001 | 2012-03-16  |       0
 UE00001 | 上田   | 一也   | ウエダ      | カズヤ      |   1 | リーダー     | Z99       |         | 2011-11-12  |       0
 WA00001 | 和田   |        |             |             |     |              | Z99       |         | 2018-05-15  |        
 YA00001 | 山田   | 奈美   | ヤマダ      | ナミ        |   2 | 主任         | Z99       | SA00001 | 2012-10-15  |       0
(26 rows)